<!DOCTYPE html">

<html>

<head>
	<meta charset="UTF-8">
	<title>Inicio</title>
	<link rel="stylesheet" type="text/css" href="proyecto.css">
</head>

<body class="color_fondo">


<!-- Titulo General -->
<h1 class="titulo_general">ARQUITECTURA DE C&Oacute;MPUTADORAS</h1>


<!-- Menú de navegación del sitio -->
<nav>
	<ul>
		  <li><a href="index.html" style="color: #81acf7";>Inicio</a></li>
		  <li><a href="unidad1.html">Unidad 1</a></li>
		  <li><a href="unidad2.html">Unidad 2</a></li>
		  <li><a href="unidad3.html">Unidad 3</a></li>
		  <li><a href="unidad4.html">Unidad 4</a></li>
		  <li><a href="practicas.html">Pr&aacute;cticas</a></li>
	</ul>
</nav>


<!-- Contenido principal -->
<div class="contenido">
	<div class="articulos">
		<div class="secciones">
			<div>
			
				<h2><b>Presentaci&oacute;n</b></h2>
				<p>Esta asignatura aporta al perfil del Ingeniero en Sistemas Computacionales las siguientes habilidades: <br> 
				<i>Implementa aplicaciones computacionales para solucionar problemas de diversos contextos,integrando diferentes tecnolog&iacute;as, plataformas o dispositivos. Diseña e implementa interfaces para la automatizaci&oacute;n de sistemas de hardware y desarrollo del software asociado. Coordina y participa en equipos multidisciplinarios para la aplicaci&oacute;n de soluciones innovadoras en diferentes contextos. Eval&uacute;a tecnolog&iacute;as de hardware para soportar aplicaciones de manera efectiva. Se desempeña con &eacute;tica, legalidad y responsabilidad social.</i><br><br>
				Para integrarla se hizo un an&aacute;lisis de la materia de Principios El&eacute;ctricos y Aplicaciones Digitales, identificando temas de electr&oacute;nica digital que tienen mayor aplicaci&oacute;n en el que hacer profesional del Ingeniero en Sistemas Computacionales.<br><br>
				Puesto que esta materia dar&aacute; soporte a Lenguajes y Aut&oacute;matas I, y Lenguajes de Interfaz, directamente vinculadas con desempeño profesionales, se inserta despu&eacute;s de la primera mitad de la trayectoria escolar. De manera particular, lo trabajado en esta asignatura, se aplicar&aacute; a los temas de estudios: <b>Programaci&oacute;n b&aacute;sica</b>, <b>Programaci&oacute;n de dispositivos</b>, <b>Programaci&oacute;n M&oacute;vil</b>, <b>Estructura de un traductor</b> y los <b>Aut&oacute;matas I y II</b>.</p>
				
			</div>
			<div class="imagenes"><img class="img" src="imagenes/index1.jpg"></div>
		</div>
		
		
		
		<div class="secciones">
			<div>
	
				<h2><b>Competencia(s) a Desarrollar</b></h2>
				<p>Conoce diferentes modelos de arquitecturas y recomienda aplicaciones para resolver problemas de su entorno profesional.</p>
				
			</div>
			<div class="imagenes"><img class="img" src="imagenes/index2.jpg"></div>
		</div>
		
		
		
		<div class="secciones">
			<div>
	
				<h2><b>Competencias Previas</b></h2>
				<p>Comprende y aplica las herramientas b&aacute;sicas de an&aacute;lisis de los sistemas anal&oacute;gicos y digitales para resolver problemas del &aacute;mbito computacional.</p>
				
			</div>
			<div class="imagenes"><img class="img" src="imagenes/index3.jpg"></div>
		</div>
		
		
		
		<div class="secciones2">
			<div>
	
				<h2><b>Sobre la P&aacute;gina</b></h2>
				<p>Esta p&aacute;gina web es el proyecto final de la materia llamada Arquitectura de C&oacute;mputadoras de 4to semestre en el Instituto Tecnol&oacute;gico de Saltillo para la carrera de Ingenier&iacute;a en Sistemas Computacionales de la clase de las 17:00 hrs impartida por el catedratico llamado Ing. Miguel Maldonado Leza.<br><br>

				P&aacute;gina creada y diseñada por <b>Manuel Treviño Barr&oacute;n</b>.<br><br>

				Direcci&oacute;n del ITS:<br>
				<i>Blvd. Venustiano Carranza #2400, Col. Tecnol&oacute;gico, Saltillo, Coahuila, M&eacute;xico C.P. 25280</i></p>
				
			</div>
			<div class="imagenes"><img class="img" src="imagenes/logo_tec.jpg"></div>
		</div>
		
		
		
	</div>
	
	
	
	<div class="descargable">
		<h2>Temario</h2>
			<p>En este enlace podras descargar el temario proporcionado por el Tecnol&oacute;gico Nacional de M&eacute;xico en formato de PDF:</p>
			<br>
				<a target="_blank" href="https://drive.google.com/file/d/1BjFNAjniKiQV70njnx-AJynXW8W5LENy/view?usp=share_link">Da click aqui</a>
	</div>
	
	
	
</div>


<!-- Firma y fecha de la página, ¡sólo por cortesía! -->
<footer>

	<div class="social-icons-container">
		<a target="_blank" href="https://www.facebook.com/TecNMcampusSaltillo" class="social-icon"></a>
		<a target="_blank" href="https://www.instagram.com/tecnmitsaltillo/?igshid=YmMyMTA2M2Y%3D" class="social-icon"></a>
		<a target="_blank" href="https://www.youtube.com/watch?v=wYwi_L8h00c" class="social-icon"></a>
		<a target="_blank" href="https://saltillo.tecnm.mx/#" class="social-icon"></a>
	</div>
	
	<ul class="footer-menu-container">
	   <li class="menu-item">L21051525@saltillo.tecnm.mx</li>
	   <li class="menu-item"><b><i>Matr&iacute;cula:</i></b> 21051525</li>
	   <li class="menu-item"><b><i>Materia:</i></b> Arquitectura de computadoras - 17:00 a 18:00</li>
	   <li class="menu-item"><b><i>Creado por:</i></b> Manuel Treviño Barr&oacute;n</li>
	</ul>
	
	<span class="copyright">&copy;2023, Manuel Treviño. All rights reserved</span>
	
</footer>	   


</body>

</html>